# ConnectToUpstreamNode Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalAnalyticalNode..::..ConnectToUpstreamNode Method
ElectricalAnalyticalNode Class See Also
---
Connects to upstream node.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public void ConnectToUpstreamNode(
	ElementId upstreamNodeId
)
```

Visual Basic
---
```text
Public Sub ConnectToUpstreamNode ( _
	upstreamNodeId As ElementId _
)
```

Visual C++
---
```text
public:
void ConnectToUpstreamNode(
	ElementId^ upstreamNodeId
)
```

# ### Parameters
upstreamNodeId
    Type: Autodesk.Revit.DB..::..ElementId The upstream node id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The id is not an analytical distribution node id. -or- The analytical distribution node is full of downstream nodes. -or- The analytical distribution node can not connect to the upstream node. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The analytical distribution node is full of upstream nodes. |

# See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace